[
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/",
        "title": "Robeck Dental | Trusted Dentist in Omak, Okanogan County, WA",
        "content": "Proudly serving families across the Okanogan Valley Since 1965\n\nWhere Advanced Dentistry Meets Compassionate Care\nWe’re small town friendly with big city service, innovative technology, and exceptional family dental services.\nRequest Appointment\nCall To Schedule\nMake Payment\n\nor call (509) 826-4050\n\nAward-Winning Dentist\n\nState-of-the-Art Treatments\n\nComfortable Hygiene Services\n\nComprehensive & Advanced Dentistry for Every Smile\n\nAt Robeck Dental, we provide advanced, comprehensive dental care for every stage of life. From guiding children toward lifelong oral health to offering comfortable hygiene services and take-home teeth whitening kits, we ensure every smile gets the care it deserves.\n\nWe also specialize in complex treatments like dental implants, bridges, and same-day crowns, restoring both function and confidence. Better yet, most of our implant services stay under one roof with the latest technology.\n\nWhether you’re interested in Invisalign or a complete smile transformation, our expert team is here to deliver exceptional results with personalized care.\n\nServices\nDental Implants\nInvisalign Treatment\nDental Bridges\nSame-Day Crowns\nTeeth Whitening\nSmile Transformations\nSee all our services\nMeet The Dentist\nDr. Troy has deep roots in Okanogan County, and in September, 2012, he and his family moved back home so that he could become a member of our practice. He graduated from Tonasket High School in 2000 and attended BYU before being accepted to the University of Washington School of Dentistry.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nAwards & Associations\n\nThe Smiles Behind Your Care\n\nOur team blends decades of experience with the latest technology to provide personalized care in a friendly, welcoming environment. We’re more than just your dental team—we’re your neighbours, committed to keeping Okanogan County smiling.\n\nMeet The Team\n\nWhether you’re from Omak, Okanogan, Tonasket, Oroville, Brewster or other surrounding communities, we’re glad to welcome you to our modern office in beautiful Okanogan County.\n\nWhen You Step Through Our Doors, The Focus Is On You...\n\nYour comfort, your desires, your priorities. We enjoy developing long-term relationships with our family of patients, and look forward to helping you discover how much dentistry contributes to your wellness.\n​\nSince 1965, our practice has been serving residents of north central Washington with integrity and compassion. We’ve become partners with generations of families for better health and a brighter smile, and we always welcome new patients. \n\nNew Patient Information\n\nAt Robeck Dental, we provide quality care\nin a comfortable and convenient setting.\n\nRelationships matter here. Supporting growing families and strengthening the wellness of patients at every stage of life provides the ultimate reward to our team.\n\nCompassion, Kindness, and Innovative Technology\n\nWe also recognize that people often approach us with anxiety and fear. We pride ourselves in turning these roadblocks into trust and paving the way with compassion and kindness.\n\nWe know that your time is valuable\n\nPlease use this link to fill out your new patient information.\n\nNew Patient Forms\nPayments\n\nQuality dentistry enhances your life, but it needs to fit your budget.\n\nWe offer a 5% discount if you pay up front at the time of service with cash or check. We accept major credit cards and CareCredit or Cherry for extended payment options.\n\nInsurance\n\nWe accept most insurance plans. We want you to get the most out of your budget, so we work with your insurance provider to ensure you get the best coverage available to you. We are also contracted with Delta Dental, and bill for all dental insurances as a courtesy. Read more\n\n*State insurance is assigned to state dental clinics. \n\nFinancing\n\nWe’ll discuss the cost and payment options with you before we begin. We do our best to avoid surprises when it comes to your bill, and the choice for treatment is always yours.​ Read more\n\nFrequently Asked Questions\nWhat makes Robeck Dental different from other dental offices in Omak?\n\nAt Robeck Dental, we combine modern technology with small-town care. Our practice has served Omak and the surrounding community since 1965, focusing on personalized care and long-lasting patient relationships.\n\nCan I really get a crown in just one visit?\nDoes Robeck Dental offer options for anxious patients?\nHow can I improve my smile without traditional braces?\nWhy is regular dental care important, even if my teeth feel fine?\nCan you help with missing teeth?\nWhat technology does Robeck Dental use for more accurate and comfortable care?\nDo you accept dental insurance?\nIs cosmetic dentistry only about looks?\nDo you offer family dental care?\nHow do I get started with Robeck Dental?\n\n--- Footer Information ---",
        "cleaned_content": "## Proudly serving families across the Okanogan Valley Since 1965\n\n## Where Advanced Dentistry Meets Compassionate Care\n\nWe’re small town friendly with big city service, innovative technology, and exceptional family dental services.\n\n## Award-Winning Dentist\n\n- State-of-the-Art Treatments\n- Comfortable Hygiene Services\n- Comprehensive & Advanced Dentistry for Every Smile\n\nAt Robeck Dental, we provide advanced, comprehensive dental care for every stage of life. From guiding children toward lifelong oral health to offering comfortable hygiene services and take-home teeth whitening kits, we ensure every smile gets the care it deserves.\n\nWe also specialize in complex treatments like dental implants, bridges, and same-day crowns, restoring both function and confidence. Most of our implant services stay under one roof with the latest technology.\n\nWhether you’re interested in Invisalign or a complete smile transformation, our expert team is here to deliver exceptional results with personalized care.\n\n### Services\n- Dental Implants\n- Invisalign Treatment\n- Dental Bridges\n- Same-Day Crowns\n- Teeth Whitening\n- Smile Transformations\n- [See all our services](#)\n\n## Meet The Dentist\n\nDr. Troy has deep roots in Okanogan County, and in September 2012, he and his family moved back home so that he could become a member of our practice. He graduated from Tonasket High School in 2000 and attended BYU before being accepted to the University of Washington School of Dentistry.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\n### Awards & Associations\n\nThe Smiles Behind Your Care\n\nOur team blends decades of experience with the latest technology to provide personalized care in a friendly, welcoming environment. We’re more than just your dental team—we’re your neighbors, committed to keeping Okanogan County smiling.\n\n## Meet The Team\n\nWhether you’re from Omak, Okanogan, Tonasket, Oroville, Brewster, or other surrounding communities, we’re glad to welcome you to our modern office in beautiful Okanogan County.\n\nWhen You Step Through Our Doors, The Focus Is On You...\n\nYour comfort, your desires, your priorities. We enjoy developing long-term relationships with our family of patients and look forward to helping you discover how much dentistry contributes to your wellness.\n\nSince 1965, our practice has been serving residents of north central Washington with integrity and compassion. We’ve become partners with generations of families for better health and a brighter smile, and we always welcome new patients.\n\n### New Patient Information\n\nAt Robeck Dental, we provide quality care in a comfortable and convenient setting.\n\nRelationships matter here. Supporting growing families and strengthening the wellness of patients at every stage of life provides the ultimate reward to our team.\n\n### Compassion, Kindness, and Innovative Technology\n\nWe also recognize that people often approach us with anxiety and fear. We pride ourselves on turning these roadblocks into trust and paving the way with compassion and kindness.\n\nWe know that your time is valuable. Please use this link to fill out your new patient information.\n\n- [New Patient Forms](#)\n- Payments\n\nQuality dentistry enhances your life, but it needs to fit your budget.\n\nWe offer a 5% discount if you pay upfront at the time of service with cash or check. We accept major credit cards and CareCredit or Cherry for extended payment options.\n\n### Insurance\n\nWe accept most insurance plans. We work with your insurance provider to ensure you get the best coverage available to you. We are also contracted with Delta Dental and bill for all dental insurances as a courtesy.\n\n*State insurance is assigned to state dental clinics.*\n\n### Financing\n\nWe’ll discuss the cost and payment options with you before we begin. We do our best to avoid surprises when it comes to your bill, and the choice for treatment is always yours.\n\n### Frequently Asked Questions\n\n1. What makes Robeck Dental different from other dental offices in Omak?\n2. Can I really get a crown in just one visit?\n3. Does Robeck Dental offer options for anxious patients?\n4. How can I improve my smile without traditional braces?\n5. Why is regular dental care important, even if my teeth feel fine?\n6. Can you help with missing teeth?\n7. What technology does Robeck Dental use for more accurate and comfortable care?\n8. Do you accept dental insurance?\n9. Is cosmetic dentistry only about looks?\n10. Do you offer family dental care?\n11. How do I get started with Robeck Dental?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/meet-the-team/",
        "title": "Meet the Team | Robeck Dental | Omak, WA",
        "content": "Meet the Team\nDr. Troy Robeck\n\nDr. Troy grew up in Okanogan County and graduated from Tonasket High School in 2000. After completing his bachelor’s degree in Exercise Science from BYU in 2006, he was admitted to the University of Washington School of Dentistry, graduating in 2010 with honors as an inductee into the national dental society, Omicron Kappa Upsilon. Dr. Troy completed his first two years of practice at a community dental clinic in Alaska, then joined Dr. Greg Grillo in 2012 to form Grillo Robeck Dental. After 10 years of an amazing partnership, Dr. Troy purchased the practice completely in 2022 as Dr. Greg retired from clinical dentistry.\n\nAt UW, Dr. Troy was deeply involved in leadership within organized dentistry and was awarded the Washington State Dental Association award for student leadership. In addition, he discovered that his interests extended beyond routine dentistry as he developed a passion for placing and restoring dental implants. In his practice, Dr. Troy emphasizes the importance of maintaining a full set of strong, healthy teeth and the tissues that support them. He offers many options to make this a reality for his patients, including orthodontics with Invisalign, dental implants in a variety of uses, and complex restorative dentistry to maintain and bring back the quality of life we are all meant to have.\n\nDr. Troy is married to his wife, Laura, and they have 5 children. He loves hiking and climbing mountains (conquering Mt. Rainier in 2018), running, traveling, and nearly everything the outdoors offers. He stays active and involved in both church and community activities. Dr. Troy maintains membership in the American Dental Association, Washington State Dental Association, and the Academy of General Dentistry.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nAmanda C\nDental Hygienist\nAmanda G\nDental Assistant & Sterlization Manager\nAmy\nDental Assistant\nBeth\nDental Hygienist\nCassidy\nFront Desk\nDiana\nFront Desk\nJennah\nSterilization Tech\nKim\nDental Hygienist\nKristy\nDental Hygienist\nMegan\nDental Hygienist\n\n--- Footer Information ---",
        "cleaned_content": "## Meet the Team\n\n### Dr. Troy Robeck\nDr. Troy Robeck grew up in Okanogan County and graduated from Tonasket High School in 2000. He completed his bachelor’s degree in Exercise Science from BYU in 2006 and graduated from the University of Washington School of Dentistry in 2010 with honors. Dr. Troy was inducted into the national dental society, Omicron Kappa Upsilon. He started his practice at a community dental clinic in Alaska before forming Grillo Robeck Dental with Dr. Greg Grillo in 2012. In 2022, Dr. Troy purchased the practice entirely as Dr. Greg retired from clinical dentistry.\n\nDuring his time at UW, Dr. Troy was actively involved in leadership roles within organized dentistry and received the Washington State Dental Association award for student leadership. He developed a passion for placing and restoring dental implants beyond routine dentistry. Dr. Troy focuses on maintaining strong, healthy teeth and supporting tissues, offering various options such as orthodontics with Invisalign, dental implants, and complex restorative dentistry.\n\nDr. Troy is married to Laura and has 5 children. He enjoys hiking, mountain climbing, running, traveling, and outdoor activities. He is engaged in church and community activities and is a member of the American Dental Association, Washington State Dental Association, and the Academy of General Dentistry.\n\nExperience how Dr. Robeck can help you achieve your perfect smile.\n\n### Team Members\n- Amanda C: Dental Hygienist\n- Amanda G: Dental Assistant & Sterilization Manager\n- Amy: Dental Assistant\n- Beth: Dental Hygienist\n- Cassidy: Front Desk\n- Diana: Front Desk\n- Jennah: Sterilization Tech\n- Kim: Dental Hygienist\n- Kristy: Dental Hygienist\n- Megan: Dental Hygienist"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/post-opcare/",
        "title": "Post-Op care - Robeck Dental",
        "content": "Post-Op Instructions\nCrowns and Bridges\nExtractions /Oral Surgery\nRoot Canal Therapy\nWhite Fillings\nScaling and Root Planing\nVeneers\nCrowns and Bridges\n\nMost of the crowns we do involve same-day CAD-CAM restorations done in our office. This technology means you leave the office with a permanent restoration. In some cases, you may wear a a temporary restoration before you receive your permanent crown or bridge. This is not as sturdy as the permanent version, so you should be careful when cleaning and eating. You should brush the area gently and should not pull up on the tooth when flossing because it could become dislodged. The same goes for eating. You should avoid sticky or chewy foods while you have the temporary in. There may be some sensitivity and irritation after the temporary or permanent is placed. This is normal and will subside after the soft tissue heals. A warm salt water rinse will help, and you can also take Advil or Tylenol if the pain does not go away. When a lab-fabricated restoration is needed, it’s usually placed about 2-3 weeks after your first appointment. Most patients do not need to be numb for the placement. The new restoration will feel smooth to your tongue and like a natural tooth. If after placement, your bite feels abnormal in any way, you should let your dentist know. Caring for your bridge or crown is just like caring for your own teeth. You should brush and floss regularly.\n\nExtractions / Oral Surgery\n\nAfter the surgery you will want to rest. If you have been sedated, you will have a driver and someone to stay with you for the remainder of the day. You can expect for the extraction site to bleed for a little while after the surgery. Gauze will be applied at the completion of the surgery, and you will want to change it as needed in the first hour. If bleeding continues for longer than expected, apply pressure with gauze or a moist tea bag. Rest when you return home, in an elevated position. Your dentist may have prescribed pain medication. for you. Please take this as directed. You have been provided with written care instructions and a care package. Please refer to specific instructions for your care. If you are unsure, please do not hesitate to contact the office. You will be limited to soft foods for a few days after your surgery. Some recommended foods are: Gelatin Pudding Yogurt Mashed Potatoes Ice Cream Thin Soups Other foods you can eat without chewing. When drinking, make sure you do not use a straw. The sucking motion can loosen your sutures and slow the clotting process. The same goes for smoking. If you have prolonged pain, bleeding, irritation, or don’t feel that the extraction site is healing properly call your dentist for a follow up.\n\nWhite Fillings (Bonding) / Amalgams\n\nAfter the anesthesia wears off your teeth will likely be a little sensitive. You should avoid hot and cold food or drink for the next few days. After that initial period, your treated teeth will feel as good as new. Continue your normal hygiene plan to ensure that your fillings last for a long time.\n\nRoot Canal Therapy\n\nYou can expect soreness after a root canal procedure for a few days. You should avoid chewing on the side of your mouth where the procedure was performed so you do not irritate the area and also to ensure that the temporary restorative material properly sets. You will also need to take an antibiotic to treat any remaining infection in your tooth. If you notice an increasing amount of pain or tenderness, a reaction to the medication, or the loss of the temporary restoration (filling) call your dentist immediately.\n\nVeneers\n\nBefore you receive your permanent veneer you will first receive a temporary restoration. This is not as sturdy as the permanent version, so you should be careful when cleaning and eating. You should brush the area gently and should not pull up on the tooth when flossing because it could become dislodged. The same goes for eating. You should avoid sticky or chewy foods while you have the temporary in. There may be some sensitivity and irritation after the temporary or permanent is placed. This is normal and will subside after the soft tissue heals. A warm salt water rinse will help, and you can also take Advil or Tylenol if the pain does not go away. The long term restoration, in most cases, will be placed about 2 weeks after the initial appointment. The new restoration will feel smooth and like a natural tooth. You will care for your new restoration with regular brushing and flossing.\n\nScaling and Root Planing (Periodontal Therapy)\n\nAfter this procedure your gums will probably be slightly sore and irritated for a few days. You should rinse your mouth with warm salt water (1 tsp salt/8 oz water) 2-3 times a day. This will relieve the pain and cleanse the area. Brushing and flossing should be continued right after the procedure, but you should brush gently so that you do not further irritate the area. If you experience any swelling or stiffness in the area you can place a cold compress on the area and take some pain relieving medicine. Avoid any hard or chewy foods for 2-3 days after the surgery to ensure the area heals correctly. If you continue to experience pain or swelling after a few days contact your dentist.\n\n--- Footer Information ---",
        "cleaned_content": "## Post-Op Instructions\n\n### Crowns and Bridges\nMost of the crowns involve same-day CAD-CAM restorations done in our office. In some cases, you may wear a temporary restoration before receiving your permanent crown or bridge. Be cautious when cleaning and eating with the temporary restoration. Sensitivity and irritation may occur after placement, which is normal and will subside. Care for your bridge or crown as you would for your own teeth.\n\n### Extractions / Oral Surgery\nAfter surgery, rest and follow post-operative care instructions. Expect some bleeding, which should subside. Rest in an elevated position and limit yourself to soft foods. Avoid using straws or smoking. Contact your dentist if you experience prolonged pain, bleeding, or any concerns.\n\n### White Fillings (Bonding) / Amalgams\nAfter the anesthesia wears off, avoid hot and cold foods for a few days. Maintain your normal hygiene routine for long-lasting fillings.\n\n### Root Canal Therapy\nExpect soreness for a few days after the procedure. Avoid chewing on the treated side and take prescribed antibiotics. Contact your dentist if you experience increasing pain, medication reaction, or loss of the temporary restoration.\n\n### Veneers\nBefore receiving your permanent veneer, you will have a temporary restoration. Be cautious with cleaning and eating. Sensitivity and irritation may occur but will subside. Care for your new restoration with regular brushing and flossing.\n\n### Scaling and Root Planing (Periodontal Therapy)\nAfter the procedure, rinse your mouth with warm salt water to relieve pain and cleanse the area. Brush gently and avoid hard or chewy foods for a few days. Contact your dentist if you experience prolonged pain or swelling."
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/ourhistory/",
        "title": "Our History - Robeck Dental",
        "content": "Our History\nA Legacy In Okanogan County\n\nDr. Jerry Grillo started his practice in Tonasket in 1965. The youngest child of Italian immigrants homesteading in Aeneas Valley, he attended the University of Washington after graduating from Tonasket High School in 1958. Dr. Jerry moved his practice to Omak in 1972 across from the Omak Library and relocated to the Shellrock Professional Building next to the Mid Valley Hospital a few years later.\n\nDr. Jerry served patients for 48 years in Okanogan County.\n\nDr. Greg Grillo joined his father in 1999 after serving four years with the U.S. Navy as a dental officer. They practiced together until Dr. Jerry’s retirement in 2013. At this time, Dr. Troy Robeck joined the practice to continue a new chapter in providing dental care in the Okanogan Valley. Dr. Greg left clinical practice in 2022 and now works full-time as a dental marketing executive, practice coach, and educator.\n\nDr. Greg Grillo cared for patients in the U.S. Navy and Okanogan county for 27 years, and now serves dentistry in multiple capacities.\n\n--- Footer Information ---",
        "cleaned_content": "## Our History\n\nDr. Jerry Grillo started his practice in Tonasket in 1965. He attended the University of Washington after graduating from Tonasket High School in 1958. In 1972, he moved his practice to Omak across from the Omak Library and later relocated to the Shellrock Professional Building next to the Mid Valley Hospital.\n\nDr. Jerry served patients in Okanogan County for 48 years.\n\nIn 1999, Dr. Greg Grillo joined his father after serving as a dental officer in the U.S. Navy. They practiced together until Dr. Jerry's retirement in 2013. Dr. Troy Robeck then joined the practice to continue providing dental care in the Okanogan Valley. Dr. Greg transitioned to a full-time role as a dental marketing executive, practice coach, and educator in 2022.\n\nDr. Greg Grillo has served patients in the U.S. Navy and Okanogan County for 27 years and continues to contribute to dentistry in various capacities."
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/contact/",
        "title": "Contact - Robeck Dental",
        "content": "Contact\nThank you for choosing Robeck Dental\n\nWe encourage you to contact us via phone or email. Please use the contact form to the right to contact us via email. For directions to the office, please click the map below. If you have any questions or comments, please feel free to get in touch. We’re always happy to hear from you!\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRobeck Dental\n\n739 Haussler Road Omak, WA 98841\nPlease note USPS will not deliver mail to our physical address.\nPlease use: P.O. Box 1841, Omak, WA 98841\n\nOffice Hours\n\nMonday: 8:00 AM – 5:00 PM\nTuesday: 8:00 AM – 5:00 PM\nWednesday:8:00 AM – 5:00 PM\nThursday: 8:00 AM – 5:00 PM\n\nContact us\nFirst Name\nLast Name\nEmail\nPhone\nHow can we help you?\nSubmit Message\nEmergency Care\n\nWe are dedicated to helping our patients during an emergency. Please call the office and we will accommodate you as soon as possible.\n\nIn the event of a life-threatening emergency, please call 911 or visit the nearest emergency room.\n\nNOTICE OF PRIVACY PRACTICES\n\n--- Footer Information ---",
        "cleaned_content": "## Contact Information\n\n**Robeck Dental**  739 Haussler Road Omak, WA 98841  \n*Please note USPS will not deliver mail to our physical address.* *Please use: P.O. Box 1841, Omak, WA 98841*\n\n**Office Hours**  \n- Monday: 8:00 AM – 5:00 PM  \n- Tuesday: 8:00 AM – 5:00 PM  \n- Wednesday: 8:00 AM – 5:00 PM  \n- Thursday: 8:00 AM – 5:00 PM  \n\n## Contact Form\n- First Name\n- Last Name\n- Email\n- Phone\n- How can we help you?\n- Submit Message\n\n## Emergency Care\nWe are dedicated to helping our patients during an emergency. Please call the office and we will accommodate you as soon as possible.\n\nIn the event of a life-threatening emergency, please call 911 or visit the nearest emergency room.\n\n## NOTICE OF PRIVACY PRACTICES"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/cleaningprevention/",
        "title": "Cleaning & Prevention | Robeck Dental | Omak, Okanogan County, WA",
        "content": "Cleaning & Prevention\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nA focus on preventive dentistry helps you maintain the highest standard of oral health while limiting dental expenditures. A partnership between you and our team pays dividends, protecting your smile now and well into the future.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nAt home, prevention may include brushing and flossing twice a day. But many strategies and oral health aids exist that may fit your situation even better. Often patients are surprised to learn that a particular toothpaste, rinse, or specialized toothpick will serve them best and make all the difference in their efforts. Our team can help customize solutions that enhance your daily efforts, often turning frustration into smiles at the healthy changes that occur.\n\nYour diet plays a critical role in oral health as well. Acidic foods and drinks can accelerate deterioration of your teeth, and certain foods can enhance the health of your supporting jawbone and gums. Our team believes in bringing your efforts and ours into balance for optimum health.\n\nAnd of course, regular dental exams and cleanings prove vital in preventing decay and gum disease as you keep daily habits consistent. With a proactive approach, together we can prevent minor issues from becoming major procedures.\n\nOral Cancer Screening\n\nEvery time you’re in our chair, we review many aspects of your health. Subtle changes in the lining of your mouth call for a closer evaluation, regardless of whether you use tobacco or not. Early detection of oral cancer saves many lives every year, and we’re trained to recognize a myriad of oral tissue abnormalities.\n\nLearn more about oral cancer screening\nHome Care\n\nOptimal dental health results from a healthy partnership between you and us. While we can provide critical support, your efforts every day make all the difference. And with the unlimited number of product resources available today, we can help you customize a protocol that works perfectly for your dental condition.\n\nLearn more about home care\nTeeth Cleaning\n\nEveryone loves the smooth, glassy surface of freshly polished teeth. Our registered dental hygienists help you maintain optimal health, which goes far beyond polished enamel. With a regular preventive schedule, we can remove the bacterial deposits that lead to dental disease. But we can also monitor for silent problems, such as tooth decay or gum disease before they become major issues.\n\nLearn more about teeth cleaning\nPeriodontal Therapy\n\nGum disease continues to be the leading cause of tooth loss in adults today. A devastating condition when left untreated, periodontitis doesn’t have to write your story. But a strategic approach with focused treatment and home care is essential to control this chronic bacterial infection. Plus, this disease can aggravate other serious medical conditions that may seem unrelated to your mouth.\n\nLearn more about periodontal therapy\nFrequently Asked Questions\nHow often should I get a dental cleaning?\n\nWe recommend scheduling a professional dental cleaning every six months to remove plaque, tartar, and bacteria that regular brushing and flossing can’t reach. However, some patients with gum disease or other concerns may need more frequent cleanings.\n\nWhy is preventive care important if my teeth feel fine?\nWhat happens during a routine cleaning and exam?\nDoes insurance cover preventive dental care?\n\n--- Footer Information ---",
        "cleaned_content": "## Cleaning & Prevention\n\nA focus on preventive dentistry helps you maintain the highest standard of oral health while limiting dental expenditures. A partnership between you and our team pays dividends, protecting your smile now and well into the future.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\n- At home, prevention may include brushing and flossing twice a day. But many strategies and oral health aids exist that may fit your situation even better. Often patients are surprised to learn that a particular toothpaste, rinse, or specialized toothpick will serve them best and make all the difference in their efforts. Our team can help customize solutions that enhance your daily efforts, often turning frustration into smiles at the healthy changes that occur.\n\n- Your diet plays a critical role in oral health as well. Acidic foods and drinks can accelerate deterioration of your teeth, and certain foods can enhance the health of your supporting jawbone and gums. Our team believes in bringing your efforts and ours into balance for optimum health.\n\n- And of course, regular dental exams and cleanings prove vital in preventing decay and gum disease as you keep daily habits consistent. With a proactive approach, together we can prevent minor issues from becoming major procedures.\n\n## Oral Cancer Screening\n\nEvery time you’re in our chair, we review many aspects of your health. Subtle changes in the lining of your mouth call for a closer evaluation, regardless of whether you use tobacco or not. Early detection of oral cancer saves many lives every year, and we’re trained to recognize a myriad of oral tissue abnormalities.\n\n## Home Care\n\nOptimal dental health results from a healthy partnership between you and us. While we can provide critical support, your efforts every day make all the difference. And with the unlimited number of product resources available today, we can help you customize a protocol that works perfectly for your dental condition.\n\n## Teeth Cleaning\n\nEveryone loves the smooth, glassy surface of freshly polished teeth. Our registered dental hygienists help you maintain optimal health, which goes far beyond polished enamel. With a regular preventive schedule, we can remove the bacterial deposits that lead to dental disease. But we can also monitor for silent problems, such as tooth decay or gum disease before they become major issues.\n\n## Periodontal Therapy\n\nGum disease continues to be the leading cause of tooth loss in adults today. A devastating condition when left untreated, periodontitis doesn’t have to write your story. But a strategic approach with focused treatment and home care is essential to control this chronic bacterial infection. Plus, this disease can aggravate other serious medical conditions that may seem unrelated to your mouth.\n\n## Frequently Asked Questions\n\n- How often should I get a dental cleaning?\n  We recommend scheduling a professional dental cleaning every six months to remove plaque, tartar, and bacteria that regular brushing and flossing can’t reach. However, some patients with gum disease or other concerns may need more frequent cleanings.\n\n- Why is preventive care important if my teeth feel fine?\n- What happens during a routine cleaning and exam?\n- Does insurance cover preventive dental care?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/familyservices/",
        "title": "Family Dentistry | Robeck Dental | Omak, WA",
        "content": "Family Dentistry\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nWhen you step into Robeck Dental in Omak, you’ll know you’ve found the perfect place for your family’s care.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nOur team loves helping kids grow into healthy adults. At either end of the age spectrum, the bases are covered. We know that early experiences influence the value kids place on their oral health as adults. And they choose to seek or avoid future care by how they’re treated now. Rest assured, the bar sits high here.​\n\nThe services offered at Robeck Dental ensure that patients of all ages feel welcome. From the earliest check-ups to the management of orthodontic decisions, we will listen to your concerns and guide you through every stage.\n\nTeen's Dentistry\n\nParents know that teen years present unique challenges. When it comes to dental health, rapid changes influence adolescents moving into adulthood. Cavity activity can suddenly accelerate with more independence in food and drink habits. Concurrently, oral hygiene activity sometimes becomes inconsistent. A good partnership with our team can set your teen up for a lifetime of benefits.\n\nLearn more about teen's dentistry\nChildren's Dentistry\n\nHelping our youngest patients grow into healthy young adults is a highlight for our team. Children undergo constant growth and development that present special challenges for an optimal outcome. And childhood tooth decay can create a lifetime of problems often avoided with an early preventive plan.\n\nLearn more about children's dentistry\nAdult's Dentistry\n\nSometimes dental problems follow otherwise healthy people through life. Understanding the causes behind dental disease can eliminate the frustration that builds as teeth deteriorate. Creating a customized preventive routine can leave you looking forward to the good news at your dental visits.\n\nLearn more about adult's dentistry\nOrtho Screenings\n\nMetal grins fill the pages of many high school yearbooks. But braces offer benefits at many different stages of life. Identifying problems at an early age often allows ideal timing in orthodontic treatment, resulting in a perfect outcome. Monitoring growth and development at your child’s regular preventive visits is just part of our commitment to your family’s dental health.\n\nLearn more about ortho screenings\nFrequently Asked Questions\nAt what age should my child have their first dental visit?\n\nThe American Academy of Pediatric Dentistry recommends that children see a dentist by their first birthday or within six months of their first tooth coming in. Early visits help prevent cavities, ensure proper development, and make kids comfortable with dental care.\n\nDo you treat patients of all ages?\nHow can I help my child feel comfortable at the dentist?\nDo you offer family appointment scheduling?\n\n--- Footer Information ---",
        "cleaned_content": "## Family Dentistry\n\nWhen you step into Robeck Dental in Omak, you’ll know you’ve found the perfect place for your family’s care. Experience how Dr. Robeck can help you discover your perfect smile.\n\n### Our Team\nOur team loves helping kids grow into healthy adults. At either end of the age spectrum, the bases are covered. We know that early experiences influence the value kids place on their oral health as adults. Rest assured, the bar sits high here.\n\n### Services Offered\nThe services offered at Robeck Dental ensure that patients of all ages feel welcome. From the earliest check-ups to the management of orthodontic decisions, we will listen to your concerns and guide you through every stage.\n\n### Teen's Dentistry\nParents know that teen years present unique challenges. When it comes to dental health, rapid changes influence adolescents moving into adulthood. A good partnership with our team can set your teen up for a lifetime of benefits.\n\n### Children's Dentistry\nHelping our youngest patients grow into healthy young adults is a highlight for our team. Children undergo constant growth and development that present special challenges for an optimal outcome.\n\n### Adult's Dentistry\nUnderstanding the causes behind dental disease can eliminate the frustration that builds as teeth deteriorate. Creating a customized preventive routine can leave you looking forward to the good news at your dental visits.\n\n### Ortho Screenings\nIdentifying problems at an early age often allows ideal timing in orthodontic treatment, resulting in a perfect outcome. Monitoring growth and development at your child’s regular preventive visits is part of our commitment to your family’s dental health.\n\n### Frequently Asked Questions\n- At what age should my child have their first dental visit?\n  The American Academy of Pediatric Dentistry recommends that children see a dentist by their first birthday or within six months of their first tooth coming in.\n- Do you treat patients of all ages?\n- How can I help my child feel comfortable at the dentist?\n- Do you offer family appointment scheduling?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/extractionsandpreservation/",
        "title": "Extractions & Preservation | Robeck Dental | Omak, WA",
        "content": "Extractions & Preservation\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nWhile we focus on helping you maintain your teeth for a lifetime, sometimes certain teeth need to be removed. Wisdom teeth, extra teeth, or very crowded teeth present situations that may mean treatment involving removal. In some cases, severely decayed or cracked teeth, or those missing large amounts of supporting bone leave extraction as the only viable option.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nWe always consider your comfort regardless of the type of care you’re receiving. We’ll discuss your unique situation specifically to determine the best way to help you receive the treatment you need. Few patients look forward to any minor surgical procedure, but today’s methods provide the safest, least invasive care possible\n\nExtractions\n\nDespite the best intentions, teeth sometimes need to be removed. Regardless of the situation, this minor surgical procedure can be brought together in a way that considers your short and long-term concerns. From anxiety control to planning for tooth replacement, we’ll factor in every aspect of your case.\n\nLearn more about extractions\nOral Surgery\n\nMinor surgical procedures sometimes help treat problems in your mouth. Defects in the bone or compromised supporting gum tissue may sometimes undergo repair with precise surgical techniques. And quick biopsy techniques can help us learn what’s behind changes in the lining of your mouth.\n\nLearn more about oral surgery\nRoot Canals\n\nWhile many patients are concerned about root canals, modern techniques often make this procedure as quick and simple as any other procedure. Infected teeth in danger of removal can be disinfected and filled with a sealer, leaving a safe solution for problematic situations.\n\nLearn more about root canals\nFrequently Asked Questions\nWhy is bone preservation important after a tooth extraction?\n\nWhen a tooth is removed, the surrounding bone can shrink over time, leading to changes in your bite and facial structure. Bone preservation techniques, like bone grafting, help maintain the jawbone’s strength and volume, making future dental work, such as implants, more successful.\n\nWhat are my options for preserving bone after an extraction?\nHow long does it take to heal after an extraction?\nCan I get a dental implant immediately after an extraction?\n\n--- Footer Information ---",
        "cleaned_content": "## Extractions & Preservation\n\n**DR. TROY ROBECK | OMAK, WASHINGTON**\n\nWhile we focus on helping you maintain your teeth for a lifetime, sometimes certain teeth need to be removed. Wisdom teeth, extra teeth, or very crowded teeth present situations that may mean treatment involving removal. In some cases, severely decayed or cracked teeth, or those missing large amounts of supporting bone leave extraction as the only viable option.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nWe always consider your comfort regardless of the type of care you’re receiving. We’ll discuss your unique situation specifically to determine the best way to help you receive the treatment you need. Few patients look forward to any minor surgical procedure, but today’s methods provide the safest, least invasive care possible.\n\n### Extractions\n\nDespite the best intentions, teeth sometimes need to be removed. Regardless of the situation, this minor surgical procedure can be brought together in a way that considers your short and long-term concerns. From anxiety control to planning for tooth replacement, we’ll factor in every aspect of your case.\n\n* Learn more about extractions\n\n### Oral Surgery\n\nMinor surgical procedures sometimes help treat problems in your mouth. Defects in the bone or compromised supporting gum tissue may sometimes undergo repair with precise surgical techniques. And quick biopsy techniques can help us learn what’s behind changes in the lining of your mouth.\n\n* Learn more about oral surgery\n\n### Root Canals\n\nWhile many patients are concerned about root canals, modern techniques often make this procedure as quick and simple as any other procedure. Infected teeth in danger of removal can be disinfected and filled with a sealer, leaving a safe solution for problematic situations.\n\n* Learn more about root canals\n\n## Frequently Asked Questions\n\n**Why is bone preservation important after a tooth extraction?**\n\nWhen a tooth is removed, the surrounding bone can shrink over time, leading to changes in your bite and facial structure. Bone preservation techniques, like bone grafting, help maintain the jawbone’s strength and volume, making future dental work, such as implants, more successful.\n\n**What are my options for preserving bone after an extraction?**\n\n**How long does it take to heal after an extraction?**\n\n**Can I get a dental implant immediately after an extraction?**"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/cosmeticdentistry/",
        "title": "Cosmetic Dentistry | Robeck Dental | Omak, WA",
        "content": "Cosmetic Dentistry\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nSmiles matter, probably more than we realize. Volumes of research confirm the influential role of smiles on our relationships and our self-esteem. If you’re confident, you smile more. If you smile more, you feel more confident. But what if you don’t want to flash your smile because you’re embarrassed by bad teeth? It becomes a psychological short-circuit, with effects that may ripple through your life. Fortunately, a growing range of options opens doors for anyone to enjoy a stunning new smile. And our passion for enhancing smiles brings you the best in modern dentistry.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nCosmetic dental treatments can\nBrighten stained or discolored teeth\nRepair cracks or fractures\nFill gaps between teeth\nCorrect overcrowding\nReshape teeth\nReplace missing teeth\nReplace old metallic restorations, such as fillings and crowns\nPorcelain Veneers\n\nVeneers provide an artist’s touch to your smile. Custom-crafted, these ultra-thin porcelain creations work in magical ways. Regardless of your vision for your smile, chances are veneers offer an answer. When today’s modern materials meet our passion for cosmetic excellence, you’ll be amazed at what you see smiling back at you in the mirror.\n\nLearn more about porcelain veneers\nComposite Fillings\n\nCavities, chips, and fractures occur on any tooth surface throughout the mouth. Composite filling material provides a versatile solution to many common problems. Blended into a prepared area, the composite polishes to a smooth, undetectable surface.\n\nLearn more about composite fillings\nTeeth Whitening\nNothing boosts your confidence like a terrific smile. But when yellow stain dims the brilliance, it’s time to give it a lift. Professional whitening systems provide the ultimate in whitening results, quickly removing years of discoloration with quality controlled materials.\nLearn more about teeth whitening\nPorcelain Crowns\n\nDamaged teeth might seem hopeless, but there’s often still a solid foundation that leaves you with options. A crown, or cap, can bring a compromised tooth back to full function. And with modern porcelains, you’ll probably have a difficult time trying to find where the crown ends and the tooth starts.\n\nLearn more about porcelain crowns\nFrequently Asked Questions\nWhat cosmetic dental treatments do you offer?\n\nWe offer a range of cosmetic treatments, including teeth whitening, veneers, bonding, clear aligners, and gum contouring. Whether you want a brighter smile or a complete makeover, we can customize a treatment plan to fit your goals.\n\nHow long does teeth whitening last?\nAre veneers permanent?\nCan cosmetic dentistry fix crooked teeth without braces?\n\n--- Footer Information ---",
        "cleaned_content": "## Cosmetic Dentistry\n\nDr. Troy Robeck | Omak, Washington\n\nSmiles matter, probably more than we realize. Volumes of research confirm the influential role of smiles on our relationships and our self-esteem. If you’re confident, you smile more. If you smile more, you feel more confident. But what if you don’t want to flash your smile because you’re embarrassed by bad teeth? It becomes a psychological short-circuit, with effects that may ripple through your life. Fortunately, a growing range of options opens doors for anyone to enjoy a stunning new smile. And our passion for enhancing smiles brings you the best in modern dentistry.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\n### Cosmetic Dental Treatments\n- Brighten stained or discolored teeth\n- Repair cracks or fractures\n- Fill gaps between teeth\n- Correct overcrowding\n- Reshape teeth\n- Replace missing teeth\n- Replace old metallic restorations, such as fillings and crowns\n\n### Porcelain Veneers\n\nVeneers provide an artist’s touch to your smile. Custom-crafted, these ultra-thin porcelain creations work in magical ways. Regardless of your vision for your smile, chances are veneers offer an answer. When today’s modern materials meet our passion for cosmetic excellence, you’ll be amazed at what you see smiling back at you in the mirror.\n\n[Learn more about porcelain veneers](link)\n\n### Composite Fillings\n\nCavities, chips, and fractures occur on any tooth surface throughout the mouth. Composite filling material provides a versatile solution to many common problems. Blended into a prepared area, the composite polishes to a smooth, undetectable surface.\n\n[Learn more about composite fillings](link)\n\n### Teeth Whitening\n\nNothing boosts your confidence like a terrific smile. But when yellow stain dims the brilliance, it’s time to give it a lift. Professional whitening systems provide the ultimate in whitening results, quickly removing years of discoloration with quality controlled materials.\n\n[Learn more about teeth whitening](link)\n\n### Porcelain Crowns\n\nDamaged teeth might seem hopeless, but there’s often still a solid foundation that leaves you with options. A crown, or cap, can bring a compromised tooth back to full function. And with modern porcelains, you’ll probably have a difficult time trying to find where the crown ends and the tooth starts.\n\n[Learn more about porcelain crowns](link)\n\n### Frequently Asked Questions\n\n#### What cosmetic dental treatments do you offer?\n\nWe offer a range of cosmetic treatments, including teeth whitening, veneers, bonding, clear aligners, and gum contouring. Whether you want a brighter smile or a complete makeover, we can customize a treatment plan to fit your goals.\n\n#### How long does teeth whitening last?\n#### Are veneers permanent?\n#### Can cosmetic dentistry fix crooked teeth without braces?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/rootcanals/",
        "title": "Root Canals | Robeck Dental | Omak, WA",
        "content": "Root Canals\n\nToothaches provide a vivid reminder that teeth aren’t just inert pieces of hard tissue floating in the gums. Instead, they’re intricately formed parts with layers of hard substances overlaying a delicate core. Coursing through the tooth’s center, this vital bundle of nerves and blood vessels provides nutrients and sensation to each tooth. As long as the tooth stays healthy, you’re rarely aware of the systems at work.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nBut pain rapidly changes your awareness in any part of the body. Tooth pain can be especially alarming, and it’s meant to warn you that something’s not right. Pain tells us that the bundle of nerves and vessels inside your tooth is irritated, damaged, or under attack.\n\nA deep cavity can give bacteria access to the inner nerve bundle. A crack extending into the same region can create stress that will need additional care to relieve. In some cases, a significant infection may develop in your jaw without any symptoms at all. If we determine that the nerve won’t recover or infection is present, then root canal treatment may be suggested.\n\nModern anesthetics provide powerful numbing for gentle removal of the inflamed nerve inside the tooth. The nerve canal undergoes disinfection and careful shaping, and a sealer fills the internal space. A filling or crown over the tooth helps return the tooth to its original condition.\n\nBut Are They Safe?\n\nInternet articles continue to circulate claiming adverse health effects from root canals, despite years of research proving otherwise. Many of these claims rest on unsubstantiated theories put forward decades ago without any scientific basis. They’ve been thoroughly debunked by the most credible sources, supported by unbiased research projects. In fact, one popular Facebook article sounding a false alarm shakily rests on a 100-year-old study tossed aside long ago.\n\nProfessional organizations routinely review a broad range of research projects throughout the world. The American Association of Endodontists stays abreast of all the current and past research and can clearly support the safety of this vital service. In fact, new techniques and materials make root canal treatment more successful than ever. However, even older methods still hold a proven track record, allowing millions of damaged teeth to continue functioning.\n\nFrequently Asked Questions\nDo root canals hurt?\n\nNo, modern root canals are virtually painless thanks to advanced techniques and local anesthesia. Most patients report that the experience is similar to getting a filling, with minimal discomfort during and after the procedure.\n\nHow do I know if I need a root canal?\nWhat happens during a root canal?\nHow long does a root canal last?\n\n--- Footer Information ---",
        "cleaned_content": "## Root Canals\n\nToothaches remind us that teeth are complex structures with sensitive nerves and blood vessels. Pain indicates potential issues with the tooth's core, requiring attention to prevent further damage.\n\n### Procedure Overview\n- Root canal treatment involves removing the inflamed nerve from the tooth.\n- The nerve canal is disinfected, shaped, and sealed to restore the tooth's health.\n- A filling or crown is placed to protect the tooth.\n\n### Safety Concerns\n- Claims of adverse health effects from root canals lack scientific basis.\n- Extensive research supports the safety and effectiveness of modern root canal procedures.\n- Professional organizations endorse the safety and success rates of root canal treatments.\n\n## Frequently Asked Questions\n\n*Do root canals hurt?*\n- Modern root canals are virtually painless due to advanced techniques and anesthesia.\n\n*How do I know if I need a root canal?*\n*What happens during a root canal?*\n*How long does a root canal last?*"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/cerec/",
        "title": "CEREC Same-Day Crowns | Robeck Dental | Omak, WA",
        "content": "CEREC: Same-Day Crowns\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nCEREC is an advanced dental restorative system that allows your dentist to restore decayed teeth, place metal-free crowns, and remove defective or unsightly fillings in just ONE appointment!  Even dental implants replacing missing teeth will soon be crafted using this proven technology!\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nWHAT DOES IT STAND FOR?\nCHAIRSIDE: The technology is in the dental operatory and used while you are in the chair\nECONOMICAL: The visit is time-efficient for you at the same cost as a lab-fabricated crown\nRESTORATIONS: The procedure restores your tooth to its natural beauty, function, and strength\nESTHETIC: The restorations are metal-free and tooth-colored\nCERAMIC: High-strength ceramics are used that are close in composition to your natural tooth structure\n\nDr. Robeck and his team and are passionate about helping the Okanogan Valley by restoring dental function to improve patient’s health, confidence and appeal through the use of CEREC single visit tooth replacement technology.\n\nSound like something you’re interested in?\n\nFrequently Asked Questions\nWhat are CEREC same-day crowns?\n\nCEREC crowns are high-quality ceramic crowns that are designed, created, and placed in a single visit using advanced CAD/CAM technology. This means no temporary crowns, no messy impressions, and no waiting weeks for a permanent restoration.\n\nHow long does it take to get a CEREC crown?\nAre CEREC crowns as durable as traditional crowns?\nWhat are the benefits of CEREC crowns?\n\n--- Footer Information ---",
        "cleaned_content": "## CEREC: Same-Day Crowns\n\nCEREC is an advanced dental restorative system that allows your dentist to restore decayed teeth, place metal-free crowns, and remove defective or unsightly fillings in just ONE appointment! Even dental implants replacing missing teeth will soon be crafted using this proven technology!\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\n## WHAT DOES IT STAND FOR?\n* CHAIRSIDE: The technology is in the dental operatory and used while you are in the chair\n* ECONOMICAL: The visit is time-efficient for you at the same cost as a lab-fabricated crown\n* RESTORATIONS: The procedure restores your tooth to its natural beauty, function, and strength\n* ESTHETIC: The restorations are metal-free and tooth-colored\n* CERAMIC: High-strength ceramics are used that are close in composition to your natural tooth structure\n\nDr. Robeck and his team are passionate about helping the Okanogan Valley by restoring dental function to improve patients' health, confidence, and appeal through the use of CEREC single visit tooth replacement technology.\n\n## Frequently Asked Questions\n* What are CEREC same-day crowns?\n* CEREC crowns are high-quality ceramic crowns that are designed, created, and placed in a single visit using advanced CAD/CAM technology. This means no temporary crowns, no messy impressions, and no waiting weeks for a permanent restoration.\n* How long does it take to get a CEREC crown?\n* Are CEREC crowns as durable as traditional crowns?\n* What are the benefits of CEREC crowns?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/implants/",
        "title": "Dental Implants | Robeck Dental | Omak, WA",
        "content": "Dental Implants\nWhere Technology Meets Experience\n\nAre you self-conscious about your smile due to missing teeth? Do you miss the ability to properly chew your favorite food? If so, implants could be the solution!\n\nCarefully placed implants in the jaw serve as an anchor for replacement teeth. They’re crafted from titanium, a non-allergenic bio-compatible material that is accepted by the human body.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nOur Process\n\nDr. Robeck works directly with patients to design and customize teeth that restore function and make you want to smile. Get exceptional results with full-service implantology, including placements, abutments, and crowns.\n\n1\nIn-Depth Customized Consultation\n2\nDetailed 3-D Imaging Technology\n3\nLocal Anesthetic or Sedation for Comfort\n4\nDental Implants Function Like Natural Teeth\nDr. Troy Robeck is an award-winning dental implant dentist in Omak Washington\nBenefits of Implants\nLook, feel, and function like natural teeth\nRestores confidence in your smile\nCan last for many years, even decades with proper care\nHelps prevent resorption of the jawbone\nSecure and stable chewing function\nAdjacent teeth benefit from load-sharing by implants\n3-D imaging\n\n3-D imaging provides mapping of nerves, bone, and teeth for unprecedented levels of planning detail.\n\nDr. Troy Robeck received the Implant Student of the Year award while attending the University of Washington School of Dentistry. He has completed several advanced implant courses since including an intensive 50 hour program under the instruction of an implant specialist. Utilizing one of the most advanced systems available, he routinely places implants in conjunction with restoration of your smile by either of our doctors.\n\nDiscover Okanogan Valley’s most experienced dental implant center. Technology, teamwork, and training bring the finest dentistry to you at Robeck Dental.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nTake an inside look at the technology behind our implant services in this short video.\n\nDr. Troy Robeck is an award-winning dental implant expert from the American Academy of Implant Dentistry.\n\nFrequently Asked Questions\nWhat are dental implants?\n\nDental implants are permanent tooth replacements that consist of a titanium post surgically placed into the jawbone, acting as a root for a natural-looking crown, bridge, or denture. They restore both function and aesthetics, closely mimicking real teeth.\n\nHow long do dental implants last?\nIs the implant procedure painful?\nWho is a good candidate for dental implants?\n\n--- Footer Information ---",
        "cleaned_content": "## Dental Implants\n\nAre you self-conscious about your smile due to missing teeth? Do you miss the ability to properly chew your favorite food? If so, implants could be the solution! Carefully placed implants in the jaw serve as an anchor for replacement teeth. They’re crafted from titanium, a non-allergenic bio-compatible material that is accepted by the human body.\n\n### Our Process\n\nDr. Robeck works directly with patients to design and customize teeth that restore function and make you want to smile. Get exceptional results with full-service implantology, including placements, abutments, and crowns.\n\n- In-Depth Customized Consultation\n- Detailed 3-D Imaging Technology\n- Local Anesthetic or Sedation for Comfort\n- Dental Implants Function Like Natural Teeth\n\nDr. Troy Robeck is an award-winning dental implant dentist in Omak Washington.\n\n### Benefits of Implants\n\n- Look, feel, and function like natural teeth\n- Restores confidence in your smile\n- Can last for many years, even decades with proper care\n- Helps prevent resorption of the jawbone\n- Secure and stable chewing function\n- Adjacent teeth benefit from load-sharing by implants\n\n### 3-D Imaging\n\n3-D imaging provides mapping of nerves, bone, and teeth for unprecedented levels of planning detail.\n\nDr. Troy Robeck received the Implant Student of the Year award while attending the University of Washington School of Dentistry. He has completed several advanced implant courses since including an intensive 50-hour program under the instruction of an implant specialist. Utilizing one of the most advanced systems available, he routinely places implants in conjunction with restoration of your smile by either of our doctors.\n\nDiscover Okanogan Valley’s most experienced dental implant center. Technology, teamwork, and training bring the finest dentistry to you at Robeck Dental.\n\nTake an inside look at the technology behind our implant services in this short video.\n\nDr. Troy Robeck is an award-winning dental implant expert from the American Academy of Implant Dentistry.\n\n### Frequently Asked Questions\n\n**What are dental implants?**\nDental implants are permanent tooth replacements that consist of a titanium post surgically placed into the jawbone, acting as a root for a natural-looking crown, bridge, or denture. They restore both function and aesthetics, closely mimicking real teeth.\n\n**How long do dental implants last?**\n**Is the implant procedure painful?**\n**Who is a good candidate for dental implants?**"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/invisalign/",
        "title": "Orthodontics: Braces & Invisalign | Robeck Dental | Omak, WA",
        "content": "Orthodontics: Braces & Invisalign\nDR. TROY ROBECK | OMAK WASHINGTON | INVISALIGN\nWhere Technology Meets Experience\n\nOur practice has been offering Invisalign since 2005, and we’ve treated patients from age 14 to 70.  Dr. Robeck captures digital scans of your teeth and creates a 3-D computer projection to develop a series of custom made, removable clear trays or “aligners” to use in conjunction with your personal treatment plan. The aligners are changed about every one to two weeks, and over time gently and gradually shift your teeth into the desired position. Many cases are completed in less than a year, although more complex cases may take a little longer.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nBenefits to Invisalign\nClear aligners are virtually invisable\nSmooth comfortable plastic aligners\nAligners are removable for easy cleaning\nEat whatever you want\n\nNothing compares to the convenience and comfort that you will enjoy with Invisalign. And no matter what stage you’re at in life, you will appreciate how our cutting-edge approach to treatment has very little impact on you live but has a significant positive impact. Sure, there are other options out there for straightening your teeth, but none  on how you look and feel about yourself.\n\nWe are now accepting new Invisalign patients and would like to offer you a free no obligation consultation to answer any more questions you may have and to determine if you’re a good candidate for Invisalign.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\nFrequently Asked Questions\nWhat’s the difference between Invisalign and traditional braces?\n\nInvisalign uses clear, removable aligners to straighten teeth, while traditional braces use metal brackets and wires. Invisalign is nearly invisible and allows for easier eating and cleaning, while braces are better for more complex cases. Our practice provides Invisalign treatment and refers patients needing braces to a trusted orthodontist.\n\nHow long does Invisalign treatment take?\nIs Invisalign as effective as braces?\nHow much does Invisalign cost?\n\n--- Footer Information ---",
        "cleaned_content": "## Orthodontics: Braces & Invisalign\n\nOur practice has been offering Invisalign since 2005, treating patients from age 14 to 70. Dr. Robeck captures digital scans of your teeth to create custom-made, removable clear trays or \"aligners\" for your treatment plan. The aligners are changed every one to two weeks, gradually shifting your teeth into the desired position. Cases are typically completed in less than a year.\n\n### Benefits to Invisalign\n* Clear aligners are virtually invisible\n* Smooth, comfortable plastic aligners\n* Aligners are removable for easy cleaning\n* Eat whatever you want\n\nInvisalign offers convenience and comfort with minimal impact on your daily life. Our approach focuses not only on how you look but also on how you feel about yourself.\n\nWe are accepting new Invisalign patients and offer a free consultation to determine if you're a good candidate.\n\n### Frequently Asked Questions\n* What’s the difference between Invisalign and traditional braces?\n  Invisalign uses clear, removable aligners, while traditional braces use metal brackets and wires. Invisalign is nearly invisible, allows for easier eating and cleaning, and is suitable for less complex cases.\n\n* How long does Invisalign treatment take?\n* Is Invisalign as effective as braces?\n* How much does Invisalign cost?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/oralappliances/",
        "title": "Oral Appliances | Robeck Dental | Omak, WA",
        "content": "Oral Appliances\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nOne of our goals is to provide the most conservative treatment possible in every situation. Oral appliances offer simple, non-invasive care for a variety of conditions. Regardless of the application, every appliance we prescribe is custom-crafted for you with excellent fit and function.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nAppliances designed on models of your teeth can be used to fit on either upper or lower teeth, or on both at the same time. Whether we’re treating nighttime sleep grinding, diagnosed obstructive sleep apnea, bite problems or jaw joint disorders, appliance therapy may aid our treatment. We employ a variety of innovative designs depending on treatment goals and your preferences.\n\nTeeth Grinding\nTeeth are the hardest substance in our bodies and can withstand a tremendous amount of force. But damage can occur to this highly mineralized surface, especially when grinding forces start to wear it away. A habit of nighttime clenching or grinding will harm teeth, muscles, and jaw joints over time. Protecting against abrasive forces is critical in these cases.\nLearn more about teeth grinding\nFrequently Asked Questions\nWhat is a night guard, and how does it help with teeth grinding?\n\nA night guard is a custom-made oral appliance worn while sleeping to prevent teeth grinding (bruxism). It acts as a protective barrier, reducing wear on your teeth, preventing jaw pain, and minimizing headaches caused by grinding.\n\nHow do I know if I need a night guard?\nHow is a custom night guard different from an over-the-counter one?\nHow long does a night guard last?\n\n--- Footer Information ---",
        "cleaned_content": "## Oral Appliances\n\n**DR. TROY ROBECK | OMAK, WASHINGTON**\n\nOne of our goals is to provide the most conservative treatment possible in every situation. Oral appliances offer simple, non-invasive care for a variety of conditions. Regardless of the application, every appliance we prescribe is custom-crafted for you with excellent fit and function.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\n### Request Appointment\n\nAppliances designed on models of your teeth can be used to fit on either upper or lower teeth, or on both at the same time. Whether we’re treating nighttime sleep grinding, diagnosed obstructive sleep apnea, bite problems or jaw joint disorders, appliance therapy may aid our treatment. We employ a variety of innovative designs depending on treatment goals and your preferences.\n\n**Teeth Grinding**\n\nTeeth are the hardest substance in our bodies and can withstand a tremendous amount of force. But damage can occur to this highly mineralized surface, especially when grinding forces start to wear it away. A habit of nighttime clenching or grinding will harm teeth, muscles, and jaw joints over time. Protecting against abrasive forces is critical in these cases.\n\n### Frequently Asked Questions\n\n* What is a night guard, and how does it help with teeth grinding?\n  \n  A night guard is a custom-made oral appliance worn while sleeping to prevent teeth grinding (bruxism). It acts as a protective barrier, reducing wear on your teeth, preventing jaw pain, and minimizing headaches caused by grinding.\n\n* How do I know if I need a night guard?\n* How is a custom night guard different from an over-the-counter one?\n* How long does a night guard last?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/sedationdentistry/",
        "title": "Relax with Sedation Dentistry | Robeck Dental | Omak, WA",
        "content": "Sedation Dentistry\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nMany people feel anxious before and during dental procedures. It’s okay to feel nervous or even fearful when anticipating an appointment. We understand that our patients aren’t all the same, and we have great news: you have options! You can experience dental treatment in a comfortable, customized approach with several different methods of sedation.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nThe most common forms of sedation used in dentistry are inhalation, oral, and intravenous sedation. While making dentistry much easier for you, it is important to understand that they are not pain-killers, and regular numbing medications still prove essential. But sedation will make every part of your treatment more enjoyable if you’re anxious.\n\nAt Robeck Dental, we offer sedation options to help you get the care you deserve. While we don’t perform IV sedation in our office, we can help you connect with specialists we trust if you prefer full sleep dentistry.\n\nFrequently Asked Questions\nWhat types of sedation do you offer?\n\nWe offer nitrous oxide (laughing gas) and oral sedation to help patients feel more relaxed during treatment. For patients needing deeper IV sedation, we can refer you to a trusted specialist.\n\nHow does nitrous oxide (laughing gas) work?\nWhat is oral sedation, and how does it compare to nitrous oxide?\nIs sedation dentistry safe?\n\n--- Footer Information ---",
        "cleaned_content": "## Sedation Dentistry\n\nMany people feel anxious before and during dental procedures. It’s okay to feel nervous or even fearful when anticipating an appointment. We understand that our patients aren’t all the same, and we have great news: you have options! You can experience dental treatment in a comfortable, customized approach with several different methods of sedation.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\n### The most common forms of sedation used in dentistry are:\n* Inhalation\n* Oral\n* Intravenous sedation\n\nWhile making dentistry much easier for you, it is important to understand that they are not pain-killers, and regular numbing medications still prove essential. But sedation will make every part of your treatment more enjoyable if you’re anxious.\n\nAt Robeck Dental, we offer sedation options to help you get the care you deserve. While we don’t perform IV sedation in our office, we can help you connect with specialists we trust if you prefer full sleep dentistry.\n\n## Frequently Asked Questions\n\n* What types of sedation do you offer?\n  - We offer nitrous oxide (laughing gas) and oral sedation to help patients feel more relaxed during treatment. For patients needing deeper IV sedation, we can refer you to a trusted specialist.\n* How does nitrous oxide (laughing gas) work?\n* What is oral sedation, and how does it compare to nitrous oxide?\n* Is sedation dentistry safe?"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/technology/",
        "title": "Advanced Dental Technology | Robeck Dental | Omak, WA",
        "content": "Technology\nDR. TROY ROBECK | OMAK, WASHINGTON\n\nAt Robeck Dental in Omak, you’ll discover dental care at the highest level possible:\n\nTechnology, advanced training, and compassionate service blended perfectly together.\n\nExperience how Dr. Robeck can help you discover your perfect smile.\n\nRequest Appointment\n\nWe carefully selects technologies proven to deliver the finest experience to their patients. This means comfortable procedures and predictable results. A winning formula, you’ll find that contemporary dental care with Robeck Dental leaves you smiling.\n\nIntra-oral camera\nA picture explains what words never can, especially when it comes to your teeth. Miniature LED cameras bring the details of our mouths to life in full color.\nLearn more about intra-oral camera\nDigital X-rays\nDigital films with exquisite detail and dramatically reduced radiation exposure offer the ultimate in safety and diagnostic capability.\nLearn more about digital x-rays\nCBCT (3D) Imaging\n\nWe use CBCT 3D imaging to capture detailed, low-radiation scans of your teeth and jaw. This advanced technology allows for precise diagnosis and treatment planning for implants, orthodontics, TMJ care, and more—helping us provide safer, more effective dental care.\n\nFrequently Asked Questions\nWhat are digital X-rays, and how do they benefit me?\n\nDigital X-rays use advanced technology to capture clear images of your teeth and jaw with minimal radiation. These images can be instantly viewed on a screen, making it easier for us to diagnose and create treatment plans. They are not only safer but also more eco-friendly since there’s no need for traditional film processing.\n\nWhat is CBCT imaging, and how does it differ from regular X-rays?\nWhat is an intra-oral camera, and how does it help with my treatment?\nHow does dental technology improve my overall dental experience?\n\n--- Footer Information ---",
        "cleaned_content": "## Technology at Robeck Dental\n\nAt Robeck Dental in Omak, you’ll discover dental care at the highest level possible: technology, advanced training, and compassionate service blended perfectly together. Experience how Dr. Robeck can help you discover your perfect smile.\n\n### Technologies Offered\n\n- **Intra-oral camera:** A picture explains what words never can, especially when it comes to your teeth. Miniature LED cameras bring the details of our mouths to life in full color.\n  *Learn more about intra-oral camera*\n\n- **Digital X-rays:** Digital films with exquisite detail and dramatically reduced radiation exposure offer the ultimate in safety and diagnostic capability.\n  *Learn more about digital x-rays*\n\n- **CBCT (3D) Imaging:** We use CBCT 3D imaging to capture detailed, low-radiation scans of your teeth and jaw. This advanced technology allows for precise diagnosis and treatment planning for implants, orthodontics, TMJ care, and more—helping us provide safer, more effective dental care.\n\n### Frequently Asked Questions\n\n1. **What are digital X-rays, and how do they benefit me?**\n   Digital X-rays use advanced technology to capture clear images of your teeth and jaw with minimal radiation. These images can be instantly viewed on a screen, making it easier for us to diagnose and create treatment plans. They are not only safer but also more eco-friendly since there’s no need for traditional film processing.\n\n2. **What is CBCT imaging, and how does it differ from regular X-rays?**\n3. **What is an intra-oral camera, and how does it help with my treatment?**\n4. **How does dental technology improve my overall dental experience?**"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/newpatients/",
        "title": "New Patients - Robeck Dental",
        "content": "New Patients\nWelcome! We're Glad You're Here.\n\nIf you’re like most patients, you appreciate being informed before your dental visits. Here’s an overview of what you can expect when visiting Robeck Dental.\n\nRequest Appointment\nPatient Portal\n\nPlease take a moment and access you patient portal to fill out paperwork online. If you have any questions along the way, feel free to contact our practice.\n\nOur relationship with you rests on a foundation of mutual respect and genuine listening. Your first visit includes quality time to ask questions, express your concerns, and share anything you want us to know.\n\nYou’ll step out of our office with a deeper understanding of your oral and general health. Together we’ll also form a path towards your dental goals. If you have an immediate dental concern, we’ll take care of that first.  Good dentistry blends short and long-term needs into a cohesive plan.\n\nWe schedule dedicated time with Dr. Robeck to cover the following areas:\n\n1\nDiscussion of Your Goals and Concerns\n2\nHealth History Review\n3\nOral Cancer Screening\n4\nGum Disease Screening/Charting\n5\nCavity, Fracture, Wear and Missing Tooth Exam/Charting\n6\nDigital X-Ray Review\nA Positive Future\n\nWhether you’re just a few months overdue or a few years have slipped by, you’re in the right place when you enter Robeck Dental. We enjoy helping patients explore a positive future regardless of your previous experience.\n\nOnce we’ve gathered a few records, your doctor personally discusses your current condition with you. Together, you can create a healthy, effective plan that meets your dental and personal goals. Prioritizing and staging your care gives you the smile you need within a budget and time frame that fits your situation.\n\nAbove all, we go beyond expectations to make you feel relaxed at every visit. Any concerns about anxiety can be considered at your first visit, and we’ll discuss innovative ways to put your comfort first. Your physical and emotional wellbeing remain our constant focus regardless of treatment goals.\n\nCONTACT US HERE AND WE'LL FIND A CONVENIENT TIME FOR YOUR FIRST VISIT\nFrequently Asked Questions\nWhat can I expect during my first visit to Robeck Dental?\n\nYour initial appointment is designed to be comprehensive and patient-focused. We allocate quality time for you to ask questions, express concerns, and share any relevant health information. The visit includes a review of your health history, an oral cancer screening, gum disease evaluation, cavity and tooth wear assessment, and digital X-rays as needed. Our goal is to understand your oral health thoroughly and collaborate with you to achieve your dental goals.\n\nHow do I access and complete the new patient forms?\nDoes Robeck Dental accept my dental insurance?\nWhere is Robeck Dental located, and what are the office hours?\n\n--- Footer Information ---",
        "cleaned_content": "## New Patients Welcome! We're Glad You're Here.\n\nIf you’re like most patients, you appreciate being informed before your dental visits. Here’s an overview of what you can expect when visiting Robeck Dental.\n\n### Request Appointment\n### Patient Portal\n\nPlease take a moment and access your patient portal to fill out paperwork online. If you have any questions along the way, feel free to contact our practice.\n\nOur relationship with you rests on a foundation of mutual respect and genuine listening. Your first visit includes quality time to ask questions, express your concerns, and share anything you want us to know.\n\nYou’ll step out of our office with a deeper understanding of your oral and general health. Together we’ll also form a path towards your dental goals. If you have an immediate dental concern, we’ll take care of that first. Good dentistry blends short and long-term needs into a cohesive plan.\n\nWe schedule dedicated time with Dr. Robeck to cover the following areas:\n\n* Discussion of Your Goals and Concerns\n* Health History Review\n* Oral Cancer Screening\n* Gum Disease Screening/Charting\n* Cavity, Fracture, Wear and Missing Tooth Exam/Charting\n* Digital X-Ray Review\n\n### A Positive Future\n\nWhether you’re just a few months overdue or a few years have slipped by, you’re in the right place when you enter Robeck Dental. We enjoy helping patients explore a positive future regardless of your previous experience.\n\nOnce we’ve gathered a few records, your doctor personally discusses your current condition with you. Together, you can create a healthy, effective plan that meets your dental and personal goals. Prioritizing and staging your care gives you the smile you need within a budget and time frame that fits your situation.\n\nAbove all, we go beyond expectations to make you feel relaxed at every visit. Any concerns about anxiety can be considered at your first visit, and we’ll discuss innovative ways to put your comfort first. Your physical and emotional wellbeing remain our constant focus regardless of treatment goals.\n\n### Frequently Asked Questions\n\n#### What can I expect during my first visit to Robeck Dental?\n\nYour initial appointment is designed to be comprehensive and patient-focused. We allocate quality time for you to ask questions, express concerns, and share any relevant health information. The visit includes a review of your health history, an oral cancer screening, gum disease evaluation, cavity and tooth wear assessment, and digital X-rays as needed. Our goal is to understand your oral health thoroughly and collaborate with you to achieve your dental goals."
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/financial-information/",
        "title": "Financial Information - Robeck Dental",
        "content": "Financial Information\nQuality dentistry that combines the latest technology, training, and materials provides long-term benefits. But we know it needs to fit your budget, and we’ll discuss the cost and payment options with you before we begin. We do our best to avoid surprises when it comes to your bill, and the choice for treatment is always yours.\nPatient Portal\nWe accept most insurance plans & major credit cards.\n\nIf you need assistance or have questions about your insurance policies or claims, our staff is knowledgeable and pleased to help you. We want you to get the most out of your budget, so we work with your insurance provider to ensure you get the best coverage available to you.\n\n​Payment is expected at the time of service. We accept checks, cash, Visa, Mastercard, or Discover.\n\nWe accept Cherry and CareCredit for extended payment options.\n\nIf you prefer the flexibility to make payments for your care, we accept Cherry and CareCredit, financing lines dedicated to your healthcare needs. Cherry is our first choice due to the benefits offered to you:\n\n1\nEasy on your credit score: No hard credit checks.\n2\nLonger period terms with fixed payments ranging from 60 months, with 0% APR options. Conditions Apply.\n3\nFast, easy online application with instant decision in most cases.\nFrequently Asked Questions\nDo you accept my dental insurance?\n\nYes, our office processes most dental insurance plans. We will gladly assist you in verifying your coverage and helping you understand your benefits. Our goal is to make your dental care as affordable and accessible as possible.\n\nWhat is Cherry, and how can it help me pay for my dental care?\nDo you accept credit cards for payment?\nDo you offer any discounts for paying upfront?\n\n--- Footer Information ---",
        "cleaned_content": "## Financial Information\n\nQuality dentistry that combines the latest technology, training, and materials provides long-term benefits. We understand the importance of fitting your dental care into your budget. Before beginning any treatment, we will discuss the cost and payment options with you to avoid any surprises on your bill. The choice for treatment is always yours.\n\n### Patient Portal\n\nWe accept most insurance plans and major credit cards. If you have any questions regarding your insurance policies or claims, our knowledgeable staff is here to assist you. Our goal is to help you maximize your budget by working with your insurance provider to ensure you receive the best coverage available.\n\nPayment is expected at the time of service, and we accept various forms of payment including checks, cash, Visa, Mastercard, and Discover. Additionally, we offer extended payment options through Cherry and CareCredit.\n\nIf you prefer the flexibility of making payments for your care, we accept Cherry and CareCredit, financing options tailored to your healthcare needs. Cherry, in particular, offers benefits such as:\n\n* Easy on your credit score with no hard credit checks.\n* Longer period terms with fixed payments ranging from 60 months, including 0% APR options (Conditions Apply).\n* Fast and easy online application with instant decisions in most cases.\n\n## Frequently Asked Questions\n\n1. **Do you accept my dental insurance?**\n   - Yes, our office processes most dental insurance plans. We are happy to assist you in verifying your coverage and understanding your benefits to make your dental care as affordable and accessible as possible.\n\n2. **What is Cherry, and how can it help me pay for my dental care?**\n   \n3. **Do you accept credit cards for payment?**\n   \n4. **Do you offer any discounts for paying upfront?**"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/our-products/",
        "title": "Explore Our Products | Robeck Dental | Omak, WA",
        "content": "Our Products\nTake Home Whitening\nNumerous whitening products crowd supermarket shelves. While we don’t discourage these methods, you may want to consider the advantages of using one of our professional whitening products. They go to work faster and provider better results.\nHome Dental Care\nSome patients identified with high risk for dental problems benefit from even more personalized routines and products. Simple, inexpensive additions can transform the environment of your mouth and dramatically reduce disease activity.\nFrequently Asked Questions\nDo you sell electric toothbrushes in your office?\n\nYes, we offer recommended electric toothbrushes in our office, including models like the Quip Electric Toothbrush. These toothbrushes are a great option for maintaining optimal oral hygiene between visits. Ask us about the different models and find the one that best suits your needs.\n\nCan I purchase a water flosser from your office?\nDo you offer professional teeth whitening kits?\nCan I buy prescription-strength toothpaste at your office?\n\n--- Footer Information ---",
        "cleaned_content": "## Our Products\n- **Take Home Whitening**\n  Numerous whitening products crowd supermarket shelves. While we don’t discourage these methods, you may want to consider the advantages of using one of our professional whitening products. They go to work faster and provide better results.\n\n- **Home Dental Care**\n  Some patients identified with high risk for dental problems benefit from even more personalized routines and products. Simple, inexpensive additions can transform the environment of your mouth and dramatically reduce disease activity.\n\n## Frequently Asked Questions\n- **Do you sell electric toothbrushes in your office?**\n  Yes, we offer recommended electric toothbrushes in our office, including models like the Quip Electric Toothbrush. These toothbrushes are a great option for maintaining optimal oral hygiene between visits. Ask us about the different models and find the one that best suits your needs.\n\n- **Can I purchase a water flosser from your office?**\n- **Do you offer professional teeth whitening kits?**\n- **Can I buy prescription-strength toothpaste at your office?**"
    },
    {
        "client_id": "443f5716-27d3-463a-9377-33a666f5ad88",
        "url": "https://www.robeckdental.com/testimonials/",
        "title": "Testimonials - Robeck Dental",
        "content": "Testimonials\nWe love our patients. Thankfully, the feeling is mutual.\nPlease enjoy reading our reviews from our dental family.\nEXCELLENT\nBased on 7 reviews\nbobby g penney jr\n2021-04-05\nThere isn't a better Dentist than Dr Grillo. 20 year patient and his service and staff far exceed my expectations. First class customer service. Never had to go back to fix a problem. IMHO\n \nPeggy Shaw\n2020-03-22\nThank you to this wonderful staff of caring individuals who have helped me more than words can say. Your professionalism and encouragement are outstanding!\n \nThomas Jackson\n2019-05-14\nAbsolutely fantastic service. Kind, professional, and phenomenal facility. I've been to many dentists and none come close to Grillo.\n\nHad a dental emergency today. Grillo was able to immideatly get me in, and get me taken care of. I can't speak highly enough about the service. He has great bedside manner and overall is just a great person. He's difficult not to like and you're doing yourself a disservice going anywhere else. For those that have anxiety, and are apprehensive about being seen, don't be. These people literally set the standard.\nRead more\nmatthew gilroy\n2017-04-14\nAwesome experience seeing Dr. Robeck. He is really nice and easy to talk to about any concerns you might have. The hygienists are all really nice too. Plan ahead there is a large wait for cleanings.\n \nSteve Graham\n2011-02-17\nI am definitely a satisfied patient. I just tried him out for a crown, and his office is professionally run, and they do what ever they can to minimize anxiety. The run a good schedule so they don't keep you waiting around. They have a lot of the most recent technology.\nRead more\nFrequently Asked Questions\nI see great reviews—what makes Robeck Dental different from other offices?\n\nAt Robeck Dental, we combine advanced technology with a warm, small-town feel. Patients consistently praise our gentle, personalized care and our ability to make even the most nervous visitors feel comfortable. We take the time to listen, explain options clearly, and ensure every treatment is as painless as possible.\n\nI have dental anxiety. Will I really feel comfortable here?\nIs the team just friendly, or is the dental care really that good?\nI don’t love my smile—can they really help?\n\n--- Footer Information ---",
        "cleaned_content": "## Testimonials\n\n- **bobby g penney jr**  \n  *2021-04-05*  \n  There isn't a better Dentist than Dr Grillo. 20 year patient and his service and staff far exceed my expectations. First class customer service. Never had to go back to fix a problem. IMHO\n\n- **Peggy Shaw**  \n  *2020-03-22*  \n  Thank you to this wonderful staff of caring individuals who have helped me more than words can say. Your professionalism and encouragement are outstanding!\n\n- **Thomas Jackson**  \n  *2019-05-14*  \n  Absolutely fantastic service. Kind, professional, and phenomenal facility. I've been to many dentists and none come close to Grillo. Had a dental emergency today. Grillo was able to immediately get me in, and get me taken care of. I can't speak highly enough about the service. He has great bedside manner and overall is just a great person. He's difficult not to like and you're doing yourself a disservice going anywhere else. For those that have anxiety, and are apprehensive about being seen, don't be. These people literally set the standard.\n\n- **matthew gilroy**  \n  *2017-04-14*  \n  Awesome experience seeing Dr. Robeck. He is really nice and easy to talk to about any concerns you might have. The hygienists are all really nice too. Plan ahead there is a large wait for cleanings.\n\n- **Steve Graham**  \n  *2011-02-17*  \n  I am definitely a satisfied patient. I just tried him out for a crown, and his office is professionally run, and they do whatever they can to minimize anxiety. They run a good schedule so they don't keep you waiting around. They have a lot of the most recent technology.\n\n## Frequently Asked Questions\n\n**I see great reviews—what makes Robeck Dental different from other offices?**  \nAt Robeck Dental, we combine advanced technology with a warm, small-town feel. Patients consistently praise our gentle, personalized care and our ability to make even the most nervous visitors feel comfortable. We take the time to listen, explain options clearly, and ensure every treatment is as painless as possible.\n\n**I have dental anxiety. Will I really feel comfortable here?**  \n**Is the team just friendly, or is the dental care really that good?**  \n**I don’t love my smile—can they really help?**"
    }
]
